w6d4/art_project/app/controllers/artworks_controller.rb

  def index
    render json: Artwork.all
---
SELECT "artworks".* FROM "artworks"