w6d4/art_project/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
   render json: User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "stephane"], ["email", "stephane@appacademy.smthg"], ["created_at", "2020-01-23 21:44:14.408174"], ["updated_at", "2020-01-23 21:44:14.408174"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    render json: User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Dilan"], ["updated_at", "2020-01-23 23:26:43.882417"], ["id", 2]]
---
  def update

    #its the way only change one attribute and its not chacking the permissions.
    # updated = User.update(params[:id], :name => params[:user][:name])
    # render json: updated

    #its making all changes to spesified id
    updated = User.find(params[:id])
    updated.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    destroyed = User.find(params[:id])
    destroyed.delete